[
    {
        "0":"No build selected.",
        "1":"For this build, if you prefer to use melee instead of rifles, you may put any rifle proficiency points into melee instead. \r\nFor this build, if you prefer to use shotguns instead of HMGs, you may put any MG proficiency points into shotguns instead.\r\n\r\nFor stat points:\r\nLevels 1 - 16: Put all of your points into agility, you should reach 100 agility.\r\nLevels 17 - 22: Put all of your points into critical, you should reach 55 critical.\r\nLevels 23 - 24: Put all of your points into accuracy, you should reach 35 accuracy.\r\nLevel 25: Put 1 point into accuracy and the remaining 4 into strength, you should reach 36 accuracy and 29 strength.\r\nLevels 26 - 40: Put all of your points into strength, you should reach 100 strength.\r\nLevels 41 - 50: Put all of your points into reloading, you should reach 79 reloading.\r\n\r\nFor proficiency points:\r\nLevels 1 - 25: Put all of your points into rifles. (Melee users will hit 120 proficiency at level 24 instead.)\r\nLevels 26 - 49: Put all of your points into machineguns. (Melee users will hit 120 proficiency at level 48 instead.)\r\nLevel 50: Put all of your points into explosives. (Melee users will start pushing explosives at level 49 instead.)\r\n\r\nFor equipment stats:\r\nIdeally you want everything to be godcrafted. However, the most important stats to have on your equipment are: 20+ agility on your armour and 8 critical on all of your weapons. You can live without the others, but these bonuses will make a huge difference.\r\n\r\nGoing forward:\r\nSpend all of your proficiency points maxing explosives, this weapon type is extremely important for end-game looting and can be used for grinding later on. In terms of stat points, first you should spend everything on maxing your reloading stat to improve your average dps. Then it's up to you whether to boost your endurance or accuracy first. In either case, however, you should aim for 50 endurance and 75 accuracy.\r\n\r\n\r\nBuild provided by Jacob Byus#6790 of the Dead Frontier Discord.",
        "9999":"Template - Keep at end of document."
    }
]