[
    {
        "0":"No class selected.",
        "1":"Production\/Service classes are professions capable of either producing items or providing services to other players.\r\nProduction\/Service classes have level breakpoints which determine what tier of goods or services they provide. These are as follows:\r\n\r\nProduction Classes:\r\nLevel 1\r\nLevel 10\r\nLevel 20\r\nLevel 30\r\nLevel 40\r\nLevel 50\r\nLevel 75\r\n\r\nService Classes:\r\nLevel 5\r\nLevel 15\r\nLevel 25\r\nLevel 35\r\nLevel 45\r\nLevel 75\r\n\r\n\r\nThe goods produced by production classes differ by class and are as follows:\r\n\r\nFarmer:\r\nLevel 1 - 9: 100% Millet\r\nLevel 10 - 19: 60% Seeds, 40% Millet\r\nLevel 20 - 29: 40% Potatoes, 40% Seeds, 20% Rice\r\nLevel 30 - 39: 60% Eggs, 20% Potatoes, 20% Rice\r\nLevel 40 - 49: 60% Eggs, 20% Fresh Vegetables, 20% Fresh Meat\r\nLevel 50 - 74: 60% Fresh Meat, 40% Fresh Vegetables\r\nLevel 75: 40% Fresh Milk, 40% Quinoa, 20% Fresh Meat\r\n\r\nScientist:\r\nLevel 1 - 9: 60% Steri Strips, 40% Plasters\r\nLevel 10 - 19: 40% Antibiotics, 20% Antiseptic Spray, 20% Plasters, 20% Steri Strips\r\nLevel 20 - 29: 60% Bandages, 40% Antiseptic Spray\r\nLevel 30 - 39: 60% Morphine, 40% Bandages\r\nLevel 40 - 49: 60% Nerotonin-2, 40% Morphine\r\nLevel 50 - 74: 80% Nerotonin-2, 20% Morphine\r\nLevel 75: 60% Nerotonin 8B, 20% Steroids, 20% Nerotonin-2\r\n\r\n\r\nThe services provided by service classes are based on the item's level. Your level must be equal to or greater than the required level.\r\nThe service classes can only be used on certain items, these are as follows:\r\n\r\nDoctor:\r\nAdministering healing items, improving how much healing they provide\r\n\r\nChef:\r\nCooking food items, improving the hunger they recover\r\n\r\nEngineer:\r\nRepairing armour, recovering armour durability to 100%\r\n\r\n\r\nNeither production nor service classes can perform their roles if the character is starving. Additionally, production classes are also unable to produce items if their health is critical.\r\n\r\nProduction classes produce items after 24 hours have passed since the last production. However, items will only be produced once the player logs in after those 24 hours have passed, meaning that even if you log in 48+ hours after the previous production only one set of items will be produced. Items will not be produced if you have no free inventory spaces. Production classes produce 2-4 items from those available at their level each time production is triggered in this manner.\r\nService classes can provide their services by listing them on the marketplace via the \"selling\" tab. Each time their services are used by another player it will cost your character 8% hunger (10% for engineers), and your services can be used so long as they are listed on the marketplace, even when you are logged out. Your services cannot be sold for free as there is a minimum service price of $100 from levels 1-14, and from level 15 breakpoint * 10, e.g a level 46 engineer cannot set their prices lower than $450 (level 45 breakpoint * 10).\r\n\r\n\r\nAll information sourced from the Dead Frontier 3D Wiki with clarification from braeden, eric dietz and IYNH of the Dead Frontier Discord.",
        "2":"--!-- The following information, while as accurate as possible, is a subjective assessment of the class in question. Changing your class later is extremely expensive and picking the wrong class can be a painful mistake. If you are using this tool to make a new character, please do your own research and ask questions in the Dead Frontier Discord to make sure you pick the right class for your needs. --!--\r\n\r\nRoleplay classes are called such because they do not provide any explicit stat bonuses to the character.\r\nThe only bonus provided by roleplay classes is a 30% boost to \"base\" experience, this makes them a popular choice as it drastically reduces the time taken to level, especially early on. As an example, a character with no experience bonus will need to kill 1,225 basic zombies to go from level 1 to level 10. A roleplay character, however, will have to kill 943 basic zombies to go from level 1 to level 10. This is not a perfect comparison as there are other ways to gain experience, however it shows that there is potentially significant benefits when grinding. Additionally, the experience bonus is applied to \"base\" experience. This means that while a regular player with 100% experience bonus from implants will receive 30 experience for killing a basic zombie, a player with a roleplay class and the same experience bonus will receive 39 experience. This gap gets even bigger later in the game.\r\n\r\nBecause of the experience bonus, roleplay classes are versatile and very popular with players at all stages of the game.",
        "3":"--!-- The following information, while as accurate as possible, is a subjective assessment of the class in question. Changing your class later is extremely expensive and picking the wrong class can be a painful mistake. If you are using this tool to make a new character, please do your own research and ask questions in the Dead Frontier Discord to make sure you pick the right class for your needs. --!--\r\n\r\nThe Boxer class is a great choice for players who wish to use a build which requires strength.\r\nThough at first glance it might seem like it's pushing you towards using melee with the +10 bonus to your character's melee profession, this is not the case. The +20 bonus to your character's strength stat is substantial, being the equivalent of 20 levels worth of stats after level 50. With those 20 extra stat points, your machinegun\/shotgun character will have more reloading or accuracy to work with than any other class at the same level.",
        "4":"--!-- The following information, while as accurate as possible, is a subjective assessment of the class in question. Changing your class later is extremely expensive and picking the wrong class can be a painful mistake. If you are using this tool to make a new character, please do your own research and ask questions in the Dead Frontier Discord to make sure you pick the right class for your needs. --!--\r\n\r\nThe Solider class is a powerful double-edged sword.\r\nIt offers the highest starting stat bonuses of any class and can be powerful when used right by a player that knows what they're doing. The bonus stats in strength, endurance, accuracy and reloading add up to a commanding advantage of 35 stat points, which is the equivalent of 35 levels past level 50. All of the bonus stats are useful to either machinegun or shotgun builds. It is also the only class that can max all stats at level 220.\r\nHowever, this advantage comes with a cost: a -20% penalty to \"base\" experience. This means that regardless of what level you are and how well-equipped you are, you will always level up slower than a similar or even weaker player that has a different class, and there is no way to overcome this disparity. As an example, a player with no \"base\" experience bonus needs to kill 1225 basic zombies to go from level 1 to level 10. However, a player with the soldier class' -20% \"base\" experience penalty will have to kill 1532 basic zombies to go from level 1 to level 10. This is not a perfect comparison as there are other ways to gain experience, however it shows that there is a potentially significant penalty to experience gains while grinding ad this disparity is even greater when compared to roleplay classes. Additionally, the experience penalty is applied to \"base\" experience. This means that while a regular player with 100% experience bonus from implants will receive 30 experience for killing a basic zombie, a player with the solider class will only receive 24 experience. This gap gets even bigger later in the game, especially when compared to roleplay characters.\r\n\r\nThe soldier class has the potential to be very strong in capable hands, however the cost is just as great in the hands of those unprepared. For this reason the soldier class is almost never recommended to new players as the cost of a class change is extremely expensive and not something a new player should consider.",
        "5":"--!-- The following information, while as accurate as possible, is a subjective assessment of the class in question. Changing your class later is extremely expensive and picking the wrong class can be a painful mistake. If you are using this tool to make a new character, please do your own research and ask questions in the Dead Frontier Discord to make sure you pick the right class for your needs. --!--\r\n\r\nPolice Officer is a balanced class suitable for new players who aren't concerned about grinding as fast as possible.\r\nIt offers the highest proficiency bonuses of any class and average stat bonuses which are useful for every weapon type except for melee and chainsaws. The proficiency bonuses are appealing because pistols are a cheap option for a ranged looting weapon and shotguns are the most efficient method of keeping yourself safe from aggro. The stat bonuses in accuracy and reloading are equivalent to 15 levels past level 50, and both help to improve your grinding efficiency with any gun. It is also the only class that allows the player to max all weapon proficiencies at level 325. The bonus stats are adequate, however the proficiency bonuses provide food for thought.\r\nWhile both pistol and shotguns are powerful weapons in the early-game, and perfectly adequate in the mid-game, they fall off sharply when compared to other weapon types in the late to end-game. Their main selling point is their efficiency when it comes to ammo usage; they are simply far cheaper to run than many equivalent options, however that comes at a significant performance cost. Pistols are always competing with rifles to take the spot as your ranged looting weapon and, currently, rifles win by a wide margin. Not only do they have far greater damage per hit and damage per second in the late-game, the cost of ammo becomes largely irrelevant by that point as you loot more than you use in most cases and easily make more than enough money to cover the costs of using a rifle. For shotguns, it's not much better as their damage output gets overshadowed by machineguns even by the mid-game. Their greatest weakness is perhaps their knockback; while it is great for keeping zombies away from you, it is too strong in the sense that it pushes zombies far outside of your effective range, greatly reducing the speed at which you can kill them which can become a significant issue with late to end-game hordes. However, both weapons are a great option for finding your footing in the mid-game and can be comfortably used in most situations around Secronom Bunker, allowing you to earn enough money to play around with. Though it is worth noting that, at this point, many players will consider stat-resetting to a rifle\/machinegun build.",
        "6":"--!-- The following information, while as accurate as possible, is a subjective assessment of the class in question. Changing your class later is extremely expensive and picking the wrong class can be a painful mistake. If you are using this tool to make a new character, please do your own research and ask questions in the Dead Frontier Discord to make sure you pick the right class for your needs. --!--\r\n\r\nFireman is a somewhat deceptively weak class.\r\nAt first glance fireman seems like a perfectly average class, maybe even a rather strong one. Unfortunately, this is not quite the case. The melee proficiency bonus is rather weak and not particularly attractive as melee does not scale well in the late to end-game. It is useable at all levels of the game, however the performance is relatively lacklustre when compared to equivalent rifles. Plus, melee weapons are all but completely usless for grinding. The melee proficiency is not the real issue, however, it's the stat bonus. Endurance only serves two purposes: to increase the player's health and to increase the amount of time they can sprint for. The increased sprint duration is nice to have, however the difference between a 25 endurance player and one with 124 endurance is only a couple of seconds. And increasing your health honestly isn't much more useful, the maximum health a player can have is 200 at 100 base endurance (base endurance * 2). By the time you're in the mid to late-game, having 200 health will let you survive maybe 1 additional hit over someone with just 50 health. Endurance isn't going to save you; armour is, and later armours will break long before you've taken even 20 points of health damage. Another problem with relying on health to survive is that your overall stats (with the exception of strength and endurance) are reduced by 50% when your health drops to \"critical\" status, meaning that you're significantly more likely to be unable to avoid the next hit or run away somewhere safe. Dead Frontier's gameplay is balanced around not getting hit in the first place and relying on the ability to take more hits won't end well, especially considering that most mid to end-game bosses and end-game enemies can hit for well over 200 damage per hit.",
        "7":"--!-- The following information, while as accurate as possible, is a subjective assessment of the class in question. Changing your class later is extremely expensive and picking the wrong class can be a painful mistake. If you are using this tool to make a new character, please do your own research and ask questions in the Dead Frontier Discord to make sure you pick the right class for your needs. --!--\r\n\r\nAthlete is a solid choice for new players who just want to get into the game.\r\nIt is an extremely simple class: you have more agility so you move faster, however the benefits are slightly deeper than that. Overall, agility is one of the most useful stats as it works for every build in every area of the game and just improves your experience in general. There are very few, if any, players who suggest not putting points into agility; it's just that useful. Digging a little deeper, the benefits for a new player are great as right from the start you'll be moving 10% faster than a player with any other class. 10% might not sound like much, but it's a breath of fresh air early on if you're used to playing another class. The extra speed will make you faster at looting, faster at travelling and improve your survivability when facing zombies as you can keep them at range or dodge their attacks more easily. Digging deeper still, 25 bonus stats is equivalent to 25 levels past level 50, giving you a great advantage when it comes to completing your early build. However, there is a caveat to this benefit.\r\nThe caveat is not directly related to the class or the bonuses, it is simply a matter of time. While it does make the game more comfortable early on, past a point those 25 extra stats will seem almost irrelevant when compared to the experience bonus of a roleplaying class. Eventually you will reach a level where you don't need those bonus stats for your weapons to operate at peak efficiency, and instead you'll be finding it harder and harder to push for that next level. However, even this caveat is only a matter of priorities; it does not matter if you're not someone who is particularly fussed about grinding or reaching the maximum level. If all you want to do is just play the game, athlete is one of the best options amongst the classes.",
        "8":"--!-- The following information, while as accurate as possible, is a subjective assessment of the class in question. Changing your class later is extremely expensive and picking the wrong class can be a painful mistake. If you are using this tool to make a new character, please do your own research and ask questions in the Dead Frontier Discord to make sure you pick the right class for your needs. --!--\r\n\r\nStudent is an unusual class and the only hybrid class available to players.\r\nIt is a fusion between a stat class, like Soldier or Athlete, and a roleplaying class. Unfortunately, it is largely irrelevant compared to either class type. First, the stat bonuses in strength, endurance and agility are honestly pathetic and will provide you with absolutely no real starting advantage. Plus, they're only equivalent to 5 levels past level 50 (3 levels if you don't care about endurance, and a meagre 2 levels if you don't care about strength). Second, the student class only gets 22% \"base\" experience bonus compared to a roleplay class' 30%. That's 8% less \"base\" experience bonus for only 5 bonus stats that won't help you survive, with 3 of the 5 bonus stats being in stats that you might not care about to begin with. But it's not all bad if you do choose student, as even a 22% \"base\" experience bonus provides decent benefits. As an example, a character with no experience bonus will need to kill 1,225 basic zombies to go from level 1 to level 10. A student, however, will have to kill 1005 basic zombies to go from level 1 to level 10. This is not a perfect comparison as there are other ways to gain experience, however it shows that there are decent benefits when grinding. Additionally, the experience bonus is applied to \"base\" experience. This means that while a regular player with 100% experience bonus from implants will receive 30 experience for killing a basic zombie, a player with the student class and the same experience bonus will receive 36.6 experience. This gap gets even bigger later in the game, though the student class will always fall short of the experience gains a roleplay class will achieve.\r\n\r\nDue to the irrelevant bonus stats and lesser \"base\" experience bonus, the student class is largely considered a poor choice and is almost never, if at all, recommended to players in any circumstance.",
        "9":"Template - Keep at end of document."
    }
]